app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."album_id" = ? AND "favorites"."song_name" = ? LIMIT ?  [["album_id", 2], ["song_name", "Did I Hear You Say You Love Me"], ["LIMIT", 1]]
INSERT INTO "favorites" ("album_id", "song_name") VALUES ($1, $2) RETURNING "fav_id"  [["album_id", 4], ["song_name", "Million $ Show"]]
DELETE FROM "favorites" WHERE "favorites"."favorite_id" = ?  [["favorite_id", 6]]
---
    def index
        album_id = params["album_id"]
        song_name = params["song_name"]
        @song_name = song_name

        foundFavorite = Favorites.find_by( album_id:album_id, song_name: song_name )

        if foundFavorite === nil
            newFavorite = Favorites.create(album_id: album_id, song_name: song_name)
            @fav_style = "fa-solid fa-star selected-star-color"
        else
            foundFavorite.destroy