app/controllers/styles_controller.rb

SELECT "styles".* FROM "styles"
SELECT "styles".* FROM "styles" WHERE "styles"."style_id" = ?  [["style_id", 2]]
SELECT "styles".* FROM "styles" WHERE "styles"."styles_id" = $1  [["styles_id", 5]]
UPDATE "styles" SET "style" = $1 WHERE "styles"."styles_id" = $2  [["style", "album-div album1"], ["styles_id", 5]]
SELECT "styles".* FROM "styles" WHERE "styles"."styles_id" = $1  [["styles_id", 1]]
UPDATE "styles" SET "style" = ? WHERE "styles"."style_id" = ?  [["style", "album-div album2"], ["style_id", 1]]
---
    def index
        stylesCont = Styles.all

        direction = params[:direction]

        isLeft = direction === "left"
        limit = nil
        start = nil
        shift_number = nil

        found = Styles.where(styles_id: 1)

        if isLeft
            limit = 'album5'
            start = 'album1'
            shift_number = 1
        else
            limit = 'album1'
            start = 'album5'
            shift_number = -1
        end

        stylesCont.each do |style|
            new_style = nil

            # shift all styles left or right based on direction params
            if style.style === "album-div #{limit}"
                new_style = "album-div #{start}"
                Styles.where(styles_id: style.styles_id).update(style: new_style)
            else
                new_style = 'album-div album' + "#{(Integer(style.style[-1])+shift_number)}"
                Styles.where(styles_id: style.styles_id).update(style: new_style)

SELECT "styles".* FROM "styles" WHERE "styles"."style_id" = ?  [["style_id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."album_id" = ? AND "favorites"."song_name" = ? LIMIT ?  [["album_id", 1], ["song_name", "Legend"], ["LIMIT", 1]]
---
            if new_style === 'album-div album3'
                # album3 is the selected album. The corresponding id is used to get songs for that album.
                @album_id = style.styles_id
                response = RestClient.get("https://resque.stg.hakuapp.com/songs.json?album_id=#{style.styles_id}")
                songs = JSON.parse(response)

                for song in songs
                    foundFavorite = Favorites.find_by(album_id: style.styles_id, song_name: song["song_name"])